In [160]:
people = {
    'First':['Corey','Jane','John'],
    'Last':['Schafer','Doe','Doe'],
    'Email':['coreyschafer@gmail.com','Janedoe@gmail.com','Johndoe@gmail.com']
}

In [161]:
import pandas as pd

In [162]:
df = pd.DataFrame(people)

In [163]:
df

   First     Last                   Email
0  Corey  Schafer  coreyschafer@gmail.com
1   Jane      Doe       Janedoe@gmail.com
2   John      Doe       Johndoe@gmail.com

In [164]:
# Video 5: Updating rows and columns 
df.columns

Index(['First', 'Last', 'Email'], dtype='object')

In [165]:
df.columns = ['First_name','Last_name','Email']

In [166]:
df.columns

Index(['First_name', 'Last_name', 'Email'], dtype='object')

In [167]:
df

  First_name Last_name                   Email
0      Corey   Schafer  coreyschafer@gmail.com
1       Jane       Doe       Janedoe@gmail.com
2       John       Doe       Johndoe@gmail.com

In [168]:
df.columns = [x.lower() for x in df.columns]
df

  first_name last_name                   email
0      Corey   Schafer  coreyschafer@gmail.com
1       Jane       Doe       Janedoe@gmail.com
2       John       Doe       Johndoe@gmail.com

In [169]:
df.columns = df.columns.str.replace(' ','_')
df

  first_name last_name                   email
0      Corey   Schafer  coreyschafer@gmail.com
1       Jane       Doe       Janedoe@gmail.com
2       John       Doe       Johndoe@gmail.com

In [170]:
df.rename(columns={'first_name':'First','last_name':'Last'},inplace=True)

In [171]:
df

   First     Last                   email
0  Corey  Schafer  coreyschafer@gmail.com
1   Jane      Doe       Janedoe@gmail.com
2   John      Doe       Johndoe@gmail.com

In [172]:
filt_n = (df['First']=='John') & (df['Last']=='Doe')
df.loc[filt_n]
# df[filt_n]

  First Last              email
2  John  Doe  Johndoe@gmail.com

In [173]:
df.loc[2]=['John','Cena','johncena@gmail.com']
df

   First     Last                   email
0  Corey  Schafer  coreyschafer@gmail.com
1   Jane      Doe       Janedoe@gmail.com
2   John     Cena      johncena@gmail.com

In [174]:
df.loc[2,['Last','email']]=['Doe','johndoe@gmail.com']
df

   First     Last                   email
0  Corey  Schafer  coreyschafer@gmail.com
1   Jane      Doe       Janedoe@gmail.com
2   John      Doe       johndoe@gmail.com

In [175]:
df.loc[2,'Last']='Cena'
df

   First     Last                   email
0  Corey  Schafer  coreyschafer@gmail.com
1   Jane      Doe       Janedoe@gmail.com
2   John     Cena       johndoe@gmail.com

In [176]:
df.at[2,'Last']='Doe'
df

   First     Last                   email
0  Corey  Schafer  coreyschafer@gmail.com
1   Jane      Doe       Janedoe@gmail.com
2   John      Doe       johndoe@gmail.com

In [177]:
filt = (df['email'] == 'johndoe@gmail.com')
df[filt]['Last']='Cena'

C:\Users\dell\AppData\Local\Temp\ipykernel_2856\3501612423.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df[filt]['Last']='Cena'

In [178]:
filt = (df['email'] == 'johndoe@gmail.com')
df.loc[filt,'Last']='Cena'
df

   First     Last                   email
0  Corey  Schafer  coreyschafer@gmail.com
1   Jane      Doe       Janedoe@gmail.com
2   John     Cena       johndoe@gmail.com

In [179]:
df['email'] = df['email'].str.upper()

In [180]:
df

   First     Last                   email
0  Corey  Schafer  COREYSCHAFER@GMAIL.COM
1   Jane      Doe       JANEDOE@GMAIL.COM
2   John     Cena       JOHNDOE@GMAIL.COM

In [181]:
df['email'].apply(len)

0    22
1    17
2    17
Name: email, dtype: int64

In [182]:
def update_email(email):
    return email.lower()

In [183]:
df['email'].apply(update_email)

0    coreyschafer@gmail.com
1         janedoe@gmail.com
2         johndoe@gmail.com
Name: email, dtype: object

In [184]:
df['email'] = df['email'].apply(update_email)

In [185]:
df

   First     Last                   email
0  Corey  Schafer  coreyschafer@gmail.com
1   Jane      Doe       janedoe@gmail.com
2   John     Cena       johndoe@gmail.com

In [186]:
df['email'] = df['email'].apply(lambda x: x.upper()) #lambda funct works only on series objects 
df

   First     Last                   email
0  Corey  Schafer  COREYSCHAFER@GMAIL.COM
1   Jane      Doe       JANEDOE@GMAIL.COM
2   John     Cena       JOHNDOE@GMAIL.COM

In [187]:
#Apply function on datframe 
df.apply(len, axis='columns')

0    3
1    3
2    3
dtype: int64

In [188]:
len(df['email'])

3

In [189]:
df.apply(pd.Series.min)

First                     Corey
Last                       Cena
email    COREYSCHAFER@GMAIL.COM
dtype: object

In [190]:
df.apply(lambda x: x.min())

First                     Corey
Last                       Cena
email    COREYSCHAFER@GMAIL.COM
dtype: object

In [191]:
df.applymap(len)

   First  Last  email
0      5     7     22
1      4     3     17
2      4     4     17

In [192]:
df.applymap(str.lower)

   First     Last                   email
0  corey  schafer  coreyschafer@gmail.com
1   jane      doe       janedoe@gmail.com
2   john     cena       johndoe@gmail.com

In [193]:
df

   First     Last                   email
0  Corey  Schafer  COREYSCHAFER@GMAIL.COM
1   Jane      Doe       JANEDOE@GMAIL.COM
2   John     Cena       JOHNDOE@GMAIL.COM

In [194]:
df['First'].map({'Corey':'Harsh','Jane':'Jolly'})

0    Harsh
1    Jolly
2      NaN
Name: First, dtype: object

In [195]:
df['First']=df['First'].replace({'Corey':'Harsh','Jane':'Jolly'})

In [196]:
df

   First     Last                   email
0  Harsh  Schafer  COREYSCHAFER@GMAIL.COM
1  Jolly      Doe       JANEDOE@GMAIL.COM
2   John     Cena       JOHNDOE@GMAIL.COM

In [197]:
df['First']+' '+df['Last']

0    Harsh Schafer
1        Jolly Doe
2        John Cena
dtype: object

In [198]:
df['Full_name']=df['First']+' '+df['Last']

In [199]:
df

   First     Last                   email      Full_name
0  Harsh  Schafer  COREYSCHAFER@GMAIL.COM  Harsh Schafer
1  Jolly      Doe       JANEDOE@GMAIL.COM      Jolly Doe
2   John     Cena       JOHNDOE@GMAIL.COM      John Cena

In [200]:
df.drop(columns=['First','Last'],inplace= True)

In [201]:
df

                    email      Full_name
0  COREYSCHAFER@GMAIL.COM  Harsh Schafer
1       JANEDOE@GMAIL.COM      Jolly Doe
2       JOHNDOE@GMAIL.COM      John Cena

In [202]:
df['Full_name'].str.split(' ',expand=True)

       0        1
0  Harsh  Schafer
1  Jolly      Doe
2   John     Cena

In [203]:
df[['First','Last']] = df['Full_name'].str.split(' ',expand=True)

In [204]:
df

                    email      Full_name  First     Last
0  COREYSCHAFER@GMAIL.COM  Harsh Schafer  Harsh  Schafer
1       JANEDOE@GMAIL.COM      Jolly Doe  Jolly      Doe
2       JOHNDOE@GMAIL.COM      John Cena   John     Cena

In [205]:
df.append({'First':'Tony'},ignore_index=True)

C:\Users\dell\AppData\Local\Temp\ipykernel_2856\4278517661.py:1: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  df.append({'First':'Tony'},ignore_index=True)

                    email      Full_name  First     Last
0  COREYSCHAFER@GMAIL.COM  Harsh Schafer  Harsh  Schafer
1       JANEDOE@GMAIL.COM      Jolly Doe  Jolly      Doe
2       JOHNDOE@GMAIL.COM      John Cena   John     Cena
3                     NaN            NaN   Tony      NaN

In [209]:
people2 = {
    'First':['Tony','Steve'],
    'Last':['Stark','Rogers'],
    'email':['Ironman@gmail.com','cap@gmail.com']
}
df2 = pd.DataFrame(people2)

In [210]:
df2

   First    Last              email
0   Tony   Stark  Ironman@gmail.com
1  Steve  Rogers      cap@gmail.com

In [211]:
df.append(df2,ignore_index=True,sort=False)

C:\Users\dell\AppData\Local\Temp\ipykernel_2856\1395412685.py:1: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  df.append(df2,ignore_index=True,sort=False)

                    email      Full_name  First     Last
0  COREYSCHAFER@GMAIL.COM  Harsh Schafer  Harsh  Schafer
1       JANEDOE@GMAIL.COM      Jolly Doe  Jolly      Doe
2       JOHNDOE@GMAIL.COM      John Cena   John     Cena
3       Ironman@gmail.com            NaN   Tony    Stark
4           cap@gmail.com            NaN  Steve   Rogers

In [212]:
df = df.append(df2,ignore_index=True,sort=False)

C:\Users\dell\AppData\Local\Temp\ipykernel_2856\3606867443.py:1: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  df = df.append(df2,ignore_index=True,sort=False)

In [213]:
df

                    email      Full_name  First     Last
0  COREYSCHAFER@GMAIL.COM  Harsh Schafer  Harsh  Schafer
1       JANEDOE@GMAIL.COM      Jolly Doe  Jolly      Doe
2       JOHNDOE@GMAIL.COM      John Cena   John     Cena
3       Ironman@gmail.com            NaN   Tony    Stark
4           cap@gmail.com            NaN  Steve   Rogers

In [214]:
df.drop(index=4)

                    email      Full_name  First     Last
0  COREYSCHAFER@GMAIL.COM  Harsh Schafer  Harsh  Schafer
1       JANEDOE@GMAIL.COM      Jolly Doe  Jolly      Doe
2       JOHNDOE@GMAIL.COM      John Cena   John     Cena
3       Ironman@gmail.com            NaN   Tony    Stark

In [220]:
filt=df['Last']=='Doe'
df.drop(index = df[filt].index)

                    email      Full_name  First     Last
0  COREYSCHAFER@GMAIL.COM  Harsh Schafer  Harsh  Schafer
2       JOHNDOE@GMAIL.COM      John Cena   John     Cena
3       Ironman@gmail.com            NaN   Tony    Stark
4           cap@gmail.com            NaN  Steve   Rogers